; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	image3 - mode
	image1 - mode
	infrared2 - mode
	infrared0 - mode
	GroundStation5 - direction
	GroundStation0 - direction
	Star2 - direction
	Star4 - direction
	Star1 - direction
	GroundStation6 - direction
	GroundStation3 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared2)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 image3)
	(supports instrument3 image1)
	(calibration_target instrument3 Star1)
	(supports instrument4 image1)
	(supports instrument4 image3)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument5 image3)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star4)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument6 image3)
	(supports instrument6 infrared0)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 image1)
	(calibration_target instrument7 Star1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation6)
	(supports instrument8 image3)
	(supports instrument8 image1)
	(calibration_target instrument8 Star2)
	(calibration_target instrument8 Star1)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet10)
	(supports instrument9 infrared0)
	(supports instrument9 image1)
	(supports instrument9 infrared2)
	(calibration_target instrument9 Star4)
	(supports instrument10 image3)
	(supports instrument10 infrared2)
	(supports instrument10 infrared0)
	(calibration_target instrument10 GroundStation6)
	(calibration_target instrument10 Star1)
	(supports instrument11 infrared2)
	(calibration_target instrument11 GroundStation3)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation5)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(pointing satellite2 Planet10)
	(pointing satellite4 Star7)
	(pointing satellite5 GroundStation5)
	(have_image Star7 image1)
	(have_image Planet8 image3)
	(have_image Star9 infrared2)
	(have_image Planet10 infrared0)
	(have_image Star11 image3)
	(have_image Planet12 image1)
))

)

; plan
1. (turn_to satellite4 star1 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 star1)
   goals met: 1 of 10
2. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 1 of 10
3. (calibrate satellite4 instrument8 star1)
   added: (calibrated instrument8)
   goals met: 1 of 10
4. (turn_to satellite4 planet8 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 planet8)
   goals met: 1 of 10
5. (take_image satellite4 planet8 instrument8 image3)
   added: (have_image planet8 image3)
   goals met: 2 of 10
6. (turn_to satellite4 planet12 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 planet12)
   goals met: 2 of 10
7. (turn_to satellite3 groundstation0 groundstation6)
   deleted: (pointing satellite3 groundstation6)
   added: (pointing satellite3 groundstation0)
   goals met: 2 of 10
8. (turn_to satellite0 groundstation3 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation3)
   goals met: 3 of 10
9. (take_image satellite4 planet12 instrument8 image1)
   added: (have_image planet12 image1)
   goals met: 4 of 10
10. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 4 of 10
11. (calibrate satellite3 instrument6 groundstation0)
   added: (calibrated instrument6)
   goals met: 4 of 10
12. (turn_to satellite2 planet10 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 planet10)
   goals met: 5 of 10
13. (turn_to satellite3 planet10 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet10)
   goals met: 5 of 10
14. (take_image satellite3 planet10 instrument6 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 6 of 10
15. (turn_to satellite3 star11 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 star11)
   goals met: 6 of 10
16. (take_image satellite3 star11 instrument6 image3)
   added: (have_image star11 image3)
   goals met: 7 of 10
17. (turn_to satellite3 star9 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star9)
   goals met: 7 of 10
18. (take_image satellite3 star9 instrument6 infrared2)
   added: (have_image star9 infrared2)
   goals met: 8 of 10
19. (turn_to satellite4 star7 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 star7)
   goals met: 9 of 10
20. (take_image satellite4 star7 instrument8 image1)
   added: (have_image star7 image1)
   goals met: 10 of 10
